set1 = '''
                  ;                     
                  BXY;.                 
                  FM10BBBXi             
           ,;LUNG88B7;i;7SZM1:          
       PBBMEN1FJ7:.         iUZr        
       ,7PG81U7.               Y1:      
            Bj                  .FU     
           U.                     Yk    
          ki                       S7   
         i1                         M   
         7:                         N,  
       :LBY                         vi  
      .OBBB  77ii:                  Mu  
        ,B1   :77:          7uLJr ,MBBY 
         .B         .         .    EBJ: 
          UB        ju:rU.        .M    
           JBi        ..         1B.    
            .0OU:             iFOY      
              Ek5q8FJ7L7vLuFE5BB        
             S:.   :LSP0kFv:   ij       
           .X ,;              i  u.     
           jB;B:              ,BL0L     
             iP                X,       
'''
set2 = '''
                   .L                   
                    U7i:                
                    vLrL2UJ:            
         ,,::;rLLuYYLJ::,:iJJL,         
         JZPUriii,..         :77:       
           ,iYui.              .;7      
             ii                  .v:    
            7.                     v:   
           7.  .,::                 J.  
          :i .:.:.U1          :,.   .Y  
          L.   LLiB8         5;i::,  v  
       .YJZv   BBBBJ        iu.BM ,  7. 
        rLGi   iM:7         8BBB0    r  
          L.                rBiv   .;E, 
          iL        ..             iMqY.
           j7       .r::i.         :5:  
            Lj.                   rL    
             .Jki.             .rui     
              i::vY7r:i:::::rrJN:       
             7..    ,irL7vrr.  ,:       
            7 .:              ,  i.     
           iU:2.              .5iL:     
             ,v                7.       

'''
set3 = '''
                   .L                   
                    U7i:                
                    vLrL2UJ:            
         ,,::;rLLuYYLJ::,:iJJL,         
         JZPUriii,..         :77:       
           ,iYui.              .;7      
             ii                  .v:    
            7.                     v:   
           7.  .,::                 J.  
          :i .:.:.U1          :,.   .Y  
          L.   LLiB8         5;i::,  v  
       .YJZv   BBBBJ        iu.BM ,  7. 
        rLGi   iM:7         8BBBN    r  
          L.                rBi7   .;E, 
          iL         7Ur:       .  iOXY.
           j7        U10r      iri r1.  
            Lj.      rkY   .r.;:.q.L:.  
             .UPi.   ,J    .J :: .:Y:Y. 
             ,:.:vY7i::.:::.YU      :YL 
           :i. .    .ii77vr:,B:    :7   
          :Z: ,.             iJrY5P:    
            :7F.              :Y,:      
              r                i        
'''
set4 = '''
                   .L                   
                    U7i:                
                    vLrL2UJ:            
         ,,::;rLLuYYLJ::,:iJJL,         
         JZPUriii,..         :77:       
           ,iYui.              .;7      
             ii                  .v:    
            7.                     v:   
           7.  .,::                 J.  
          :i .:.:.U1          :,.   .Y  
          L.   LLiB8         5;i::,  v  
       .YJZv   BBBBJ        iu.BM ,  7. 
        ivGi   iM:7         8BBB0    r  
          7.                rBi7   .;E, 
   .:ir:, :7         7Ur:          iGkY.
  :i7,::.;:NX.       U10r      .   :X:  
.i. i  , :;:vv.      rkY      ir7i:,r . 
:7:    :  r:  uPi.   ,J       7. L Yi,7.
 :7  : .  7  .:.:vY7i::.::::iXN     L7::
  :,,v:iri.,i. .    .ii77vri:2r.    .7L.
    ::r:. .0, ,.             :vYY:::::: 
            :7F.              :Y;i..    
              r                :        
              r                :        
'''
set5 = '''
                   .Y                   
                    U7i:                
                    vLrL2UJ:            
         ,,::;rLLjYYYJ::::ijjL,         
         JZqUriii,..        .:77:       
           ,iYU;.              .rr      
             ii                  .v:    
            7.                     7:   
           v.  .,::                 J.  
          :i .:.:.U2          :,..  .Y  
          L.   YLiB8         1;i:::  7  
        YJGv   BBBBJ        iU.BM ,  7. 
        i7Gi   iM:7         OBBBq    7  
          ;                 ;Bir   .;0, 
   ijqE2r :r .       7U;:       .  i8XY.
  L2Mr7JiZkBBi       U2Er      i;i r5.  
,qi U  7 vZ57r.      7kY   .r.i: q.L:.  
vBv    L .OS  uXi.   ,Y    .Y :: .:Y:Y. 
 YO .U :  B: .:.:vL7i::.:::.YU      :Yv 
  LrrBJFE1i.:. .    .ii77vr::B:    :7   
   .7uXj:  P, ,.             iYrY5P:    
            :7F.              :Y,:      
              r                i        

'''
set6 = '''
                   .Y                   
                    U7i:                
                    vLrL2UJ:            
         ,,::;rLLjYYYJ::::ijjL,         
         JZqUriii,..        .:77:       
           ,iYU;.              .rr      
             ii                  .v:    
            7.                     7:   
           v.  .,::                 J.  
          :i .:.:.U2          :,..  .Y  
          L.   YLiB8         1;i:::  7  
       .YJGv   BBBBJ        iU.BM ,  7. 
        i78i   iM:7         OBBBN    7  
          7.                rBi7   .;0, 
    .:;:   :         7U;:          iGkY.
  rBBBBMUqr8XL       U2Er      ,   :P:  
 YY B. Y:MBBG5.      7kY      irri:,r . 
YB7 :  2 rBM  JXi.   ,Y       7  L Yi,7.
;B8 .; L  BS .:.:vL7i::.::::iXN     L7::
 :B..B vjLM;,  .    .ii77vri:2r.    .7Y.
  .vZBBBB7,2. ,.             :vYL:::::: 
     ...    :7F.              ,Y;i..    
              r                i        
'''
set7 = '''
                   .Y                   
                    U7i:                
                    vLrL2UJ:            
         ,,::;rLLjYYYJ::::ijjL,         
         JZqUriii,..        .:77:       
           ,iYU;.              .rr      
             ii                  .v:    
            7.                     7:   
           v.  .,::                 J.  
          :i .:.:.U2          :,..  .Y  
          L.   YLiB8         1;i:::  7  
       .YJGv   BBBBJ        iU.BM ,  7. 
        i78i   iM:7         OBBBq    7  
          7.                ;Bir   .;0, 
    .:;:   :         7U;:       .  i8XY.
  rBBBBMUqr8XL       U2Er      i;i r5.  
 YY B. Y:MBBG5.      7kY   .r.i: q.L:.  
YB7 :  2 rBM  JXi.   ,Y    .Y :: .:Y:Y. 
;B8 .; L  BS .:.:vL7i::.:::.YU      :Yv 
 :B..B vjLM;,  .    .ii77vr::B:    :7   
  .vZBBBB7,2. ,.             iYrY5P:    
     ...    :7F.              :Y,:      
              r                i        

'''
set8 = '''
                  :                     
                  57i:.                 
                  7jrvuUU7:             
           .:i;LLYLU::,::7LY;,          
       7PUjLvr7i:.          ,rL:        
       .:7LYr;:                ir.      
            1i                   rr     
           r.                     i7    
          7,  ..,.                 r:   
         ,r  :.::Uv         ,ji..   Y   
         :,   :: MB         U rj.:  v.  
       ,iSi   jBBB8        ,kUBB    ::  
      .Y28k   ,BUYr        :BBBM    ji  
        .ur                 Y:.   .JMki 
          U         .              LEi, 
          ;2        i;,:;          J    
           iF,        .          rU     
             LYr.             ,7Yi      
              L7r7Yri:i:::;rLruu        
             7..   ,:77L77:.   :i       
            7 .:              ,  i.     
           iu:2,              .S:L:     
             ,v                7.       
'''


bye = '''
                  :                     
                  57i:.                 
                  7jrvuUU7:             
           .:i;LLYLU::,::7LY;,          
       7PUjLvr7i:.          ,rL:        
       .:7LYr;:                ir.      
            1i                   rr     
           r.                     i7    
          7,  ..,.                 r:   
         ,r  :.::Uv         ,ji..   Y   
         :,   :: MB         U rj.:  v.  
       ,iSi   jBBB8        ,kUBB    ::  
      .Y28k   ,BUYr        :BBBM    ji  
        .ur                 Y:.   .JMki 
          U         .              LEi, 
          ;2        i;,:;          J    
           iF,        .          rU     
             LYr.             ,7Yi      
              L7r7Yri:i:::;rLruu        
             7..   ,:77L77:.   :i       
            7 .:              ,  i.     
           iu:2,              .S:L:     
             ,v                7.       


░██████╗░░█████╗░░█████╗░██████╗░██████╗░██╗░░░██╗███████╗██╗
██╔════╝░██╔══██╗██╔══██╗██╔══██╗██╔══██╗╚██╗░██╔╝██╔════╝██║
██║░░██╗░██║░░██║██║░░██║██║░░██║██████╦╝░╚████╔╝░█████╗░░██║
██║░░╚██╗██║░░██║██║░░██║██║░░██║██╔══██╗░░╚██╔╝░░██╔══╝░░╚═╝
╚██████╔╝╚█████╔╝╚█████╔╝██████╔╝██████╦╝░░░██║░░░███████╗██╗
░╚═════╝░░╚════╝░░╚════╝░╚═════╝░╚═════╝░░░░╚═╝░░░╚══════╝╚═╝
'''

import emoji

love = '''
░░░░░░░▄▄████▄▄▄░░░░░░▄▄██████▄▄
░░░░░██▓▓▓▓▓▓▒▓▓██░░▓█▓▓▓▓▒░▒▒▓▓██
░░░██▓▓▓▓▓▓▓▓▓▒░▓▓███▓▓▓▓▓▒▒▒░░▒▓▓█
░░██▓▓▓▓▓▓▓▓▓▓▓▒▒▓▓█▓▓▓▓▓▓▓▓▓▓▒░░▓▓█
░▒█▓▓▓▓▓▓▓▓▓▓▓▓▓▓██▓██▓▓▓▓▓▓▓▓▓▒░░▓▓█
░█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒░▒▓█
░█▓▓▓▓▓▓▓▓▓▓▓▓████░████▓▓▓▓▓▓▓▓▓▒░░▓██
█▓▓▓▓▓▓▓▓▓▓▓▓██░░░░░░░██▓▓▓▓▓▓▓▓▓░░▓▓█
█▓▓▓▓▓▓▓▓▓▓▓▓▓░░█░░░█░░▓▓▓▓▓▓▓▓▓▓▒░▓▓█▒
█▓▓▓▓▓▓▓▓▓▓▓▓▓░█▒█░█▒█░▓▓▓▓▓▓▓▓▓▓▒▒▓▓█▒
█▓▓▓▓▓▓▓▓▓▓▓▓▓░░░░░░░░░▓▓▓▓▓▓▓▓▓▓▒▒▓██▒
█▓▓▓▓▓▓▓▓▓▓▓▓▓▓░▒██░░░▓▓▓▓▓▓▓▓▓▓▓▒▓▓█▓▒
░█▓▓▓▓▓▓▓▓▓▓▓▓▓▓████▓▓▓▓▓▓▓▓▓▓▓▓▓▒▓▓█▓▒
░█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓▒
░░█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓▒
░░█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓███▓▓▓▓▓▓▓▓▓▓█▓▒
░░░█▓▓▓▓▓▓▓▓▓██▓▓▓▓█████▓▓▓▓▓▓▓▓▓▓█▓▒
░░░░█▓▓▓▓▓▓▓▓██████████▓▓▓▓▓▓▓▓▓▓██▓▒
░░░░▓█▓▓▓▓▓▓▓▓██▒▒▓▒▒█▓▓▓▓▓▓▓▓▓▓██▓▒
░░░░░░█▓▓▓▓▓▓▓▓██▒▒▒█▓▓▓▓▓▓▓▓▓▓██▓▒
░░░░░░░██▓▓▓▓▓▓▓▓███▓▓▓▓▓▓▓▓▓▓██▓▒
░░░░░░░░██▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██▓▒
░░░░░░░░░░█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓▒
░░░░░░░░░░░██▓▓▓▓▓▓▓▓▓▓▓▓██▓▒
░░░░░░░░░░░░░██▓▓▓▓▓▓▓▓▓█▓▒
░░░░░░░░░░░░░░░██▓▓▓▓▓██▓▒
░░░░░░░░░░░░░░░░░█▓▓██▓▒
░░░░░░░░░░░░░░░░░░░█▓▒
'''

kiss = '''
____________________██████
_________▓▓▓▓____█████████
__ Ƹ̵̡Ӝ̵̨̄Ʒ▓▓▓▓▓=▓____▓=▓▓▓▓▓
__ ▓▓▓_▓▓▓▓░●____●░░▓▓▓▓
_▓▓▓▓_▓▓▓▓▓░░__░░░░▓▓▓▓
_ ▓▓▓▓_▓▓▓▓░░♥__♥░░░▓▓▓
__ ▓▓▓___▓▓░░_____░░░▓▓
▓▓▓▓▓____▓░░_____░░▓
_ ▓▓____ ▒▓▒▓▒___ ████
_______ ▒▓▒▓▒▓▒_ ██████
_______▒▓▒▓▒▓▒ ████████
_____ ▒▓▒▓▒▓▒_██████ ███
_ ___▒▓▒▓▒▓▒__██████ _███
_▓▓X▓▓▓▓▓▓▓__██████_ ███
▓▓_██████▓▓__██████_ ███
▓_███████▓▓__██████_ ███
_████████▓▓__██████ _███
_████████▓▓__▓▓▓▓▓▓_▒▒
_████████▓▓__▓▓▓▓▓▓
_████████▓▓__▓▓▓▓▓▓
__████████▓___▓▓▓▓▓▓
_______▒▒▒▒▒____▓▓▓▓▓▓
_______▒▒▒▒▒ _____▓▓▓▓▓
_______▒▒▒▒▒_____ ▓▓▓▓▓
_______▒▒▒▒▒ _____▓▓▓▓▓
________▒▒▒▒______▓▓▓▓▓
________█████____█████
_'▀█║────────────▄▄───────────​─▄──▄_
──█║───────▄─▄─█▄▄█║──────▄▄──​█║─█║
──█║───▄▄──█║█║█║─▄║▄──▄║█║─█║​█║▄█║
──█║──█║─█║█║█║─▀▀──█║─█║█║─█║​─▀─▀
──█║▄║█║─█║─▀───────█║▄█║─▀▀
──▀▀▀──▀▀────────────▀─█║
───────▄▄─▄▄▀▀▄▀▀▄──▀▄▄▀
──────███████───▄▀
──────▀█████▀▀▄▀
────────▀█▀


'''


huh = "¯\_( ͡👁️ ͜ʖ ͡👁️)_/¯"


explosion = '''
                               ________________
                          ____/ (  (    )   )  \___
                         /( (  (  )   _    ))  )   )\\
                       ((     (   )(    )  )   (   )  )
                     ((/  ( _(   )   (   _) ) (  () )  )
                    ( (  ( (_)   ((    (   )  .((_ ) .  )_
                   ( (  )    (      (  )    )   ) . ) (   )
                  (  (   (  (   ) (  _  ( _) ).  ) . ) ) ( )
                  ( (  (   ) (  )   (  ))     ) _)(   )  )  )
                 ( (  ( \ ) (    (_  ( ) ( )  )   ) )  )) ( )
                  (  (   (  (   (_ ( ) ( _    )  ) (  )  )   )
                 ( (  ( (  (  )     (_  )  ) )  _)   ) _( ( )
                  ((  (   )(    (     _    )   _) _(_ (  (_ )
                   (_((__(_(__(( ( ( |  ) ) ) )_))__))_)___)
                   ((__)        \\||lll|l||///          \_))
                            (   /(/ (  )  ) )\   )
                          (    ( ( ( | | ) ) )\   )
                           (   /(| / ( )) ) ) )) )
                         (     ( ((((_(|)_)))))     )
                          (      ||\(|(|)|/||     )
                        (        |(||(||)||||        )
                          (     //|/l|||)|\\ \     )
                        (/ / //  /|//||||\\  \ \  \ _)
-------------------------------------------------------------------------------
'''

exploded = '''
        ███████╗██╗░░██╗██████╗░██╗░░░░░░█████╗░██████╗░███████╗██████╗░██╗
        ██╔════╝╚██╗██╔╝██╔══██╗██║░░░░░██╔══██╗██╔══██╗██╔════╝██╔══██╗██║
        █████╗░░░╚███╔╝░██████╔╝██║░░░░░██║░░██║██║░░██║█████╗░░██║░░██║██║
        ██╔══╝░░░██╔██╗░██╔═══╝░██║░░░░░██║░░██║██║░░██║██╔══╝░░██║░░██║╚═╝
        ███████╗██╔╝╚██╗██║░░░░░███████╗╚█████╔╝██████╔╝███████╗██████╔╝██╗
        ╚══════╝╚═╝░░╚═╝╚═╝░░░░░╚══════╝░╚════╝░╚═════╝░╚══════╝╚═════╝░╚═╝
'''

matrix = '''
<<<<<<<<<<<<<<<       <!MMMMMM988Nbn:.      <<<<<<<
<<<<<<<<<<<~~        <<!XMMMMM88888888Nz    <<<<<<<
<<<<<<<<<<<         `!XXHMMMMM988888888Br   <<<<<
<<<<<<<<<<``:     :xXX9MMMMMMM888888888RM<'`<<:<<::
<<<<<<<<<<.      '<MM!"""~`"""*M888888RMM~<~<<xx<<<
<<<<<<<<<!H   'i::HHXxx.. .     ^"9M##MMX<<:<<MMHX!
<<<<<<<<<<<< ~xBHMMM?MMMHxXMMu. .df    `"!<<<<MMMMM
:::::::::xn:  9RM!!!!!MMM98NN8MHH98ixx '!!<<<!M88MM
M?MXMMMHHH9ML.MM!<<<<<!MM8888#S9MN88MMM!<<<<<<988MM
``^`""""""MMMR?!<<  <<~!MMM8X ^""#88MM?!<<:<<!988RR
           MMM!~~~` '<~<H**MRMx  .xMMM?XXXXX<x!MRRM
     :     tM~     '~ '4Mk. "!**@MMXM!<XMHHH<XXMMMM
 .:<<<<:    `      ~   <MMMM"?#*n:3M<<!MMMMM:HM!MS?
!!!!<!<<.              !tMNWiiHMM"!<<!MMMMM!MM!!!!!
XXn::<~!!:              `!MR88RM!<<<<!MMMMM!MM<!!<~
!??%H<<::<:               `"?XH<<<<<!MMMMM!MM<<<!<<
'''

from contextlib import suppress

with suppress(ZeroDivisionError):

  class EXPLOSION(Exception):
      """Exception raised for errors in the input salary.

      Attributes:
          salary -- input salary which caused the error
          message -- explanation of the error
      """

      def __init__(self, message=f"\n\n\n\n\t\t\t\t¯\_( ͡❛ ͜ʖ ͡❛)_/¯\n\n\n{exploded}\n\n\n\n{explosion}"):# message=("\n"+f"{emoji.emojize(':thumbs_down:')}"*40+kiss)):
          
          
          # message = ""
          self.message = message
          
          print(">>>>>>>>>", flush=True)
        
          super().__init__(self.message)

  print(
  f"{emoji.emojize(':thumbs_down:')}"
  )  

  import logging 
  class TracebackInfoFilter(logging.Filter):
      """Clear or restore the exception on log records"""
      def __init__(self, clear=True):
          self.clear = clear
      def filter(self, record):
          if self.clear:
              record._exc_info_hidden, record.exc_info = record.exc_info, None
              # clear the exception traceback text cache, if created.
              record.exc_text = None
          elif hasattr(record, "_exc_info_hidden"):
              record.exc_info = record._exc_info_hidden
              del record._exc_info_hidden
          return True

  # for handler in logging.Handler:
    
      # if not any(isinstance(f, TracebackInfoFilter) for f in handler.filters):
          # handler.addFilter(TracebackInfoFilter(clear=False))

  # handler_with_no_tracebacks.addFilter(TracebackInfoFilter())

  # try:
  # tmp = 0 + "test"
  # except ZeroDivisionError:
    # raise EXPLOSION


  1/0
  
  i = 0

  if i == 0:
    raise EXPLOSION
exit()

from time import sleep
import sys

import os

def clearConsole():
    command = 'clear'
    if os.name in ('nt', 'dos'):  # If Machine is running on Windows, use cls
        command = 'cls'
    os.system(command)

# clearConsole()

def COMPLETE():
    for s in [set1, set2, set3, set4, set5, set6,set4, set5, set6,set4, set5, set6, set7, set8]:
        sleep(0.2)

        clearConsole()
        print(s, end="\r")
        
        
COMPLETE()
clearConsole()
print(bye)
sleep(1)
# clearConsole()
